switchboard-pipeline/README.org
* The Switchboard Corpus

[[https://catalog.ldc.upenn.edu/LDC97S62][The Switchboard Corpus]] is a collection of telephone conversations collected in 1992-1993. It consists of about 2400 conversations between 543 speakers. Participants were auto-dialed and given one of 70 prerecorded prompts. No two participants spoke to each other more than once and no participant had the same subject prompt twice.

** [[http://www.openslr.org/5/][MSU Switchboard Transcripts]]

Mississippi State has transcribed the Switchboard corpus with word- and utterance-level timing. Each file is listed as ~swNNNNP-ms98-a-TYPE.text~ where:
- ~NNNN~ is the conversation number
- ~P~ is either "A" or "B" for the participant channel
- ~TYPE~ is either word or trans for the transcription level. MSU claims transcription word error rates below 1%.

*** Word Level Transcripts

Word level transcripts are space separated with the following format:

#+BEGIN_SRC text
swNNNNP-ms98-a-XXXX S.SSSSSS E.EEEEEE WORD
#+END_SRC

- ~NNNN~ is the conversation number, matching the filename.
- ~P~ is the participant A or B, matching the filename.
- ~XXXX~ is the word number, counting from 1.
- ~S.SSSSSS~ is the timing of the beginning of the word to the eighth of a millisecond
- ~E.EEEEEE~ is the timing of the end of the word to the eighth of a millisecond
- ~WORD~ is the word being transcribed. Non-words are fully bracketed --- [noise]. Abandoned words are bracketed and given a hyphen --- "an[y]-"

We've found word level timing to be generally reliable, though care should be taken in applying them widely.

*** Utterance Level Transcripts

Utterance level transcripts are space separated with the following format:

#+BEGIN_SRC text
swNNNNP-ms98-a-XXXX S.SSSSSS E.EEEEEE WORD...
#+END_SRC

- ~NNNN~ is the conversation number, matching the filename.
- ~P~ is the participant A or B, matching the filename.
- ~XXXX~ is the utterance number, counting from 1.
- ~S.SSSSSS~ is the timing of the beginning of the utterance to the eighth of a millisecond.
- ~E.EEEEEE~ is the timing of the end of the utterance to the eighth of a millisecond.
- ~WORD...~ is series of words being transcribed. Non-words are fully bracketed --- [noise]. Abandoned words are bracketed and given a hyphen --- "an[y]-". Each utterance has one or more words, though "[silence]" is included in each transcript as an utterance.

Utterance timing is generally unreliable. It is unclear what the assumptions are, but both beginning and ending timing can be off by as much as a half-second from word timing.
*** Processed Utterance Transcripts

Since the utterance level timing was not sufficient for conversation level analysis, We've re-worked the original transcripts into a new set of transcripts that uses the word level timing, but the utterance-level transcriptions. These files are named in the ~NNNN-P.csv~ format, where: ~NNNN~ is the conversation number and ~P~ is the participant. The format was changed to ~csv~ for ease of importing data. The first row was also dropped, since it is implicit, as were the "[silence]" turns.

The code creating these files can be found in ~re-time-msu.py~.

*** CHAT Transcripts

Transcripts in the ~.cha~ format for use with [[https://dali.talkbank.org/clan/][CLAN]] or ALAN are provided. These files are named ~NNNN.cha~ where ~NNNN~ is the conversation number. ~.cha~ is one standard for examining conversational data. These files were created with the ~msu-chat.py~ script.

** [[https://web.stanford.edu/~jurafsky/ws97/][Linguistic Consortium Transcripts]]

   
These transcripts are the original markup for [[https://www.aaai.org/Papers/Symposia/Spring/1998/SS-98-01/SS98-01-015.pdf][Stolcke et al. 1998]]. Details about the tagging schema can be found [[https://web.stanford.edu/~jurafsky/ws97/manual.august1.html][in the online coders manual]]. The Switchboard corpus is coded in SWBD-DAMSL, which is an adaptation of the DAMSL scheme proposed in [[http://www.justinecassell.com/discourse07/Week5Reading/Core_DAMSLannotation.pdf][Core and Allen 1997]].

*** [[https://www.seas.upenn.edu/~pdtb/][Penn Treebank Corpus]]

Dialogue act annotations were applied to the Penn Treebank transcriptions.

These transcripts can be found in the ~lc-sb~ folder. Within each folder, files have the format ~sw_CCXX_YYYY.utt~ where:
- ~CC~ is the collection number
- ~XX~ is the number within that collection
- ~YYYY~ is the conversation ID number.

Each file has begins with copyright information and then header information with transcriber notes. The transcript begins after a line of ~=~ marks.

Each utterance is given in the following format:

#+BEGIN_SRC text
TAG       P.N uttC: WORDS... \n
#+END_SRC

Where:
- ~TAG~ comes from the tag set in the documentation (see below for more)
- ~P~ is either "A" or "B", matching the participant
- ~N~ is the overall turn number for the conversation
- ~C~ is the utterance number within the turn
- ~WORDS~ are the transcription.

The tags in the transcriptions are chiefly from the [[https://web.stanford.edu/~jurafsky/ws97/manual.august1.html][Coders Manual]], but note that tags may be from clustered set, the Entire Label Set, the original 226 tags, or combination of multiple tags, as the called for in the [[http://www.justinecassell.com/discourse07/Week5Reading/Core_DAMSLannotation.pdf][Core and Allen]] paper proposing the ~DAMSL~ schema.

Words in the transcription are mostly word-level, but the transcripts also include markup of other sorts, such as "{D well, } [ they, +  {F uh, }" or "it seems to me <baby>  that [ it's, + it's ]". Work remains to be done about the semantics of this markup.

*** CHAT Transcripts

Transcripts in the ~.cha~ format for use with [[https://dali.talkbank.org/clan/][CLAN]] or ALAN are provided. Follow the same naming scheme as above, but with a different suffix. ~.cha~ is one standard for examining conversational data, especially in conversation analysis. These files were produced with the ~lc-cha.py~ script.

These transcripts are also annotated with sentence type tagging from the model detailed below.

* Data Transformations
