switchboard-pipeline/msu_llc/README.md

# Table of Contents

1.  [The Switchboard Corpus](#orgfa1e71b)
    1.  [MSU Switchboard Transcripts](#org71dd4e4)
        1.  [Word Level Transcripts](#orge5a59cb)
        2.  [Utterance Level Transcripts](#orgca16725)
        3.  [Processed Utterance Transcripts](#org7bd06da)
        4.  [CHAT Transcripts](#org1e6d4e7)
    2.  [Linguistic Consortium Transcripts](#org415c9c1)
        1.  [Penn Treebank Corpus](#org687bb58)
        2.  [CHAT Transcripts](#org4cd93b0)
2.  [Data Transformations](#orgd8d406c)
    1.  [Data Cleaning and Formatting Pipeline](#org90e7859)
    2.  [Dialogue Acts](#org0650842)


<a id="orgfa1e71b"></a>

# The Switchboard Corpus

[The Switchboard Corpus](https://catalog.ldc.upenn.edu/LDC97S62) is a collection of telephone conversations collected in 1992-1993. It consists of about 2400 conversations between 543 speakers. Participants were auto-dialed and given one of 70 prerecorded prompts. No two participants spoke to each other more than once and no participant had the same subject prompt twice.


<a id="org71dd4e4"></a>

## [MSU Switchboard Transcripts](http://www.openslr.org/5/)

Mississippi State has transcribed the Switchboard corpus with word- and utterance-level timing. Each file is listed as `swNNNNP-ms98-a-TYPE.text` where:

-   `NNNN` is the conversation number
-   `P` is either "A" or "B" for the participant channel
-   `TYPE` is either word or trans for the transcription level. MSU claims transcription word error rates below 1%.


<a id="orge5a59cb"></a>

### Word Level Transcripts

Word level transcripts are space separated with the following format:

    swNNNNP-ms98-a-XXXX S.SSSSSS E.EEEEEE WORD

-   `NNNN` is the conversation number, matching the filename.
-   `P` is the participant A or B, matching the filename.
-   `XXXX` is the word number, counting from 1.
-   `S.SSSSSS` is the timing of the beginning of the word to the eighth of a millisecond
-   `E.EEEEEE` is the timing of the end of the word to the eighth of a millisecond
-   `WORD` is the word being transcribed. Non-words are fully bracketed &#x2014; [noise]. Abandoned words are bracketed and given a hyphen &#x2014; "an[y]-"

We've found word level timing to be generally reliable, though care should be taken in applying them widely.


<a id="orgca16725"></a>

### Utterance Level Transcripts

Utterance level transcripts are space separated with the following format:

    swNNNNP-ms98-a-XXXX S.SSSSSS E.EEEEEE WORD...

-   `NNNN` is the conversation number, matching the filename.
-   `P` is the participant A or B, matching the filename.
-   `XXXX` is the utterance number, counting from 1.
-   `S.SSSSSS` is the timing of the beginning of the utterance to the eighth of a millisecond.
-   `E.EEEEEE` is the timing of the end of the utterance to the eighth of a millisecond.
-   `WORD...` is series of words being transcribed. Non-words are fully bracketed &#x2014; [noise]. Abandoned words are bracketed and given a hyphen &#x2014; "an[y]-". Each utterance has one or more words, though "[silence]" is included in each transcript as an utterance.

Utterance timing is generally unreliable. It is unclear what the assumptions are, but both beginning and ending timing can be off by as much as a half-second from word timing.


<a id="org7bd06da"></a>

### Processed Utterance Transcripts

Since the utterance level timing was not sufficient for conversation level analysis, We've re-worked the original transcripts into a new set of transcripts that uses the word level timing, but the utterance-level transcriptions. These files are named in the `NNNN-P.csv` format, where: `NNNN` is the conversation number and `P` is the participant. The format was changed to `csv` for ease of importing data. The first row was also dropped, since it is implicit, as were the "[silence]" turns.

The code creating these files can be found in `re-time-msu.py`.


<a id="org1e6d4e7"></a>

### CHAT Transcripts

Transcripts in the `.cha` format for use with [CLAN](https://dali.talkbank.org/clan/) or ALAN are provided. These files are named `NNNN.cha` where `NNNN` is the conversation number. `.cha` is one standard for examining conversational data. These files were created with the `msu-chat.py` script.


<a id="org415c9c1"></a>

## [Linguistic Consortium Transcripts](https://web.stanford.edu/~jurafsky/ws97/)

These transcripts are the original markup for [Stolcke et al. 1998](https://www.aaai.org/Papers/Symposia/Spring/1998/SS-98-01/SS98-01-015.pdf). Details about the tagging schema can be found [in the online coders manual](https://web.stanford.edu/~jurafsky/ws97/manual.august1.html). The Switchboard corpus is coded in SWBD-DAMSL, which is an adaptation of the DAMSL scheme proposed in [Core and Allen 1997](http://www.justinecassell.com/discourse07/Week5Reading/Core_DAMSLannotation.pdf).


<a id="org687bb58"></a>

### [Penn Treebank Corpus](https://www.seas.upenn.edu/~pdtb/)

Dialogue act annotations were applied to the Penn Treebank transcriptions.

These transcripts can be found in the `lc-sb` folder. Within each folder, files have the format `sw_CCXX_YYYY.utt` where:

-   `CC` is the collection number
-   `XX` is the number within that collection
-   `YYYY` is the conversation ID number.

Each file has begins with copyright information and then header information with transcriber notes. The transcript begins after a line of `=` marks.

Each utterance is given in the following format:

    TAG       P.N uttC: WORDS... \n

Where:

-   `TAG` comes from the tag set in the documentation (see below for more)
-   `P` is either "A" or "B", matching the participant
-   `N` is the overall turn number for the conversation
-   `C` is the utterance number within the turn
-   `WORDS` are the transcription.

The tags in the transcriptions are chiefly from the [Coders Manual](https://web.stanford.edu/~jurafsky/ws97/manual.august1.html), but note that tags may be from clustered set, the Entire Label Set, the original 226 tags, or combination of multiple tags, as the called for in the [Core and Allen](http://www.justinecassell.com/discourse07/Week5Reading/Core_DAMSLannotation.pdf) paper proposing the `DAMSL` schema.

Words in the transcription are mostly word-level, but the transcripts also include markup of other sorts, such as "{D well, } [ they, +  {F uh, }" or "it seems to me <baby>  that [ it's, + it's ]". Work remains to be done about the semantics of this markup.


<a id="org4cd93b0"></a>

### CHAT Transcripts

Transcripts in the `.cha` format for use with [CLAN](https://dali.talkbank.org/clan/) or ALAN are provided. Follow the same naming scheme as above, but with a different suffix. `.cha` is one standard for examining conversational data, especially in conversation analysis. These files were produced with the `lc-cha.py` script.

These transcripts are also annotated with sentence type tagging from the model detailed below.


<a id="orgd8d406c"></a>

# Data Transformations
