switchboard-pipeline/README.org
** Data Cleaning and Formatting Pipeline

As outlined above, our data comes from the Linguistic Consortium and Mississippi State University transcriptions of the Switchboard corpus. In order to get this data into a usable format for modeling, we've performed several transformations. The pipeline below will replicate this process:

| Script                       | Source   | Destination | Output Format | Purpose                              |
|------------------------------+----------+-------------+---------------+--------------------------------------|
| =re-utterizer.py=            | =lc-sb=  | =lc-sb=     | lc format     | Combine utterances marked as         |
|                              |          |             |               | continuations are combined with      |
|                              |          |             |               | the host utterance to complete it    |
| =merge.py=                   | =lc-sb2= | =new-sb=    | =.cha=        | Get the timing information from the  |
|                              | =msu-sb= |             |               | MSU corpus and the dialogue acts     |
|                              |          |             |               | from the Linguistic Consortium       |
|                              |          |             |               | and pile them in together.           |
| =map_acts.py=                | =new-sb= | =new-sb=    | =.cha=        | Adds swbd-damsl annotations and      |
|                              |          |             |               | function annotations according       |
|                              |          |             |               | to the table below.                  |
| =cha_to_csv.py=              | =new-sb= | =new-sb=    | =.csv=        | Convert =.cha= files to =.csv= files |
|                              |          |             |               | for ease of computation              |
| =add_fto.py=                 | =new-sb= | =new-sb=    | =.csv=        | Add column for Floor Transfer Offset |
|                              |          |             |               | for turns before floor transfer      |

There are also a few extra scripts that are not a part of the master pipeline. They may be useful for other work, like examining the files where the transcripts are too different to use both timing and dialogue act information

| Script           | Source   | Destination | Output Format | Purpose                                             |
|------------------+----------+-------------+---------------+-----------------------------------------------------|
| =lc_cha.py=      | =lc-sb2= | =lc-cha=    | =.cha=        | Converts Linguistic Consortium transcripts          |
|                  |          |             |               | to the =.cha= format                                |

