switchboard-pipeline/msu_llc/README.md


<a id="org90e7859"></a>

## Data Cleaning and Formatting Pipeline

As outlined above, our data comes from the Linguistic Consortium and Mississippi State University transcriptions of the Switchboard corpus. In order to get this data into a usable format for modeling, we've performed several transformations. The pipeline below will replicate this process:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Script</th>
<th scope="col" class="org-left">Source</th>
<th scope="col" class="org-left">Destination</th>
<th scope="col" class="org-left">Output Format</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">`re-utterizer.py`</td>
<td class="org-left">`lc-sb`</td>
<td class="org-left">`lc-sb`</td>
<td class="org-left">lc format</td>
<td class="org-left">Combine utterances marked as</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">continuations are combined with</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">the host utterance to complete it</td>
</tr>


<tr>
<td class="org-left">`merge.py`</td>
<td class="org-left">`lc-sb2`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`.cha`</td>
<td class="org-left">Get the timing information from the</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">`msu-sb`</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MSU corpus and the dialogue acts</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">from the Linguistic Consortium</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">and pile them in together.</td>
</tr>


<tr>
<td class="org-left">`map_acts.py`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`.cha`</td>
<td class="org-left">Adds swbd-damsl annotations and</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">function annotations according</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">to the table below.</td>
</tr>


<tr>
<td class="org-left">`cha_to_csv.py`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`.csv`</td>
<td class="org-left">Convert `.cha` files to `.csv` files</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">for ease of computation</td>
</tr>


<tr>
<td class="org-left">`add_fto.py`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`new-sb`</td>
<td class="org-left">`.csv`</td>
<td class="org-left">Add column for Floor Transfer Offset</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">for turns before floor transfer</td>
</tr>
</tbody>
</table>

There are also a few extra scripts that are not a part of the master pipeline. They may be useful for other work, like examining the files where the transcripts are too different to use both timing and dialogue act information

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Script</th>
<th scope="col" class="org-left">Source</th>
<th scope="col" class="org-left">Destination</th>
<th scope="col" class="org-left">Output Format</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">`lc_cha.py`</td>
<td class="org-left">`lc-sb2`</td>
<td class="org-left">`lc-cha`</td>
<td class="org-left">`.cha`</td>
<td class="org-left">Converts Linguistic Consortium transcripts</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">to the `.cha` format</td>
</tr>
</tbody>
</table>
