switchboard-pipeline/README.org
** Dialogue Acts

The Linguistic Consortium corpus is tagged according to the [[https://web.stanford.edu/~jurafsky/ws97/manual.august1.html][the annotation manual]], but was done by hand. So the data is a bit messy. By scraping the data, we come up with the following list of unique tags in the corpus along with the number of times each tag occurs in the corpus. The =description= is the human-readable description according to the annotation manual. Many of the tags are combinations of documented annotations or errors in the annotations, so the data here differs somewhat from the annotation manual. The '+', '@', and '*' annotations have been cleaned out in the transcripts in ~lc-sb2~. These are continuations, which have been merged with the rest of their utterance units; segmentation errors, which we have not fixed except where the segmentation errors co-occur with continuation annotations; and transcription errors, which are not useful unless we begin modeling at a word level.

Jurafsky et al. clustered the annotations according to the schema noted in the manual. The mapping is given below.

See [[./literature/Threlkeld_de_Ruiter.pdf][Threlkeld & de Ruiter, 2022]] for an explanation of the current set of dialogue acts, and a brief discussion of possible extensions.

| DAMSL Tag  | Count | Cluster | Description                                  | Mapping   |
|------------+-------+---------+----------------------------------------------+-----------|
| sd         | 70688 | sd      | Statement-non-opinion                        | Statement |
| b          | 36304 | b       | Acknowledge (Backchannel)                    | Other     |
| sv         | 25805 | sv      | Statement-opinion                            | Statement |
| %          | 15611 | %       | Abandoned or Turn-Exit                       | Other     |
| aa         | 10172 | aa      | Agree/Accept                                 | Other     |
| ba         |  4536 | ba      | Appreciation                                 | Statement |
| qy         |  3807 | qy      | Yes-No-Question                              | Question  |
| x          |  3653 | x       | Non-verbal                                   | Other     |
| ny         |  2839 | ny      | Yes Answers                                  | Other     |
| fc         |  2404 | fc      | Conventional-Closing                         | Other     |
| b^r        |  2126 | b       | Acknowledge Self-Repeat                      | Other     |
| sd^e       |  1952 | sd      | Statement Expansions of y/n Answers          | Statement |
| qw         |  1895 | qw      | Wh-Question                                  | Question  |
| sd(^q)     |  1342 | sd      | Statement w/ Quotation                       | Statement |
| bk         |  1257 | bk      | Response Acknowledgement                     | Other     |
| nn         |  1235 | nn      | No Answers                                   | Other     |
| qy^d       |  1229 | qy^d    | Declarative Yes-No-Question                  | Question  |
| h          |  1222 | h       | Hedge                                        | Statement |
| bh         |  1048 | bh      | Backchannel in Question Form                 | Statement |
| ^q         |   972 | ^q      | Quotation                                    | Statement |
| bf         |   941 | bf      | Summarize/reformulate                        | Statement |
| sd^t       |   930 | sd      | Statement about Task                         | Statement |
| aa^r       |   918 | aa      | Agree/Accept Repeat                          | Other     |
| +@         |   867 |         | Continuation w/ error                        | Other     |
| o          |   804 | bc      | Other                                        | Other     |
| na         |   768 | na      | Affirmative Non-Yes Answer                   | Statement |
| ^2         |   715 | ^2      | Collaborative Completion                     | Other     |
| b^m        |   694 | b^m     | Repeat Phrase                                | Other     |
| ad         |   674 | ad      | Action Directive                             | Command   |
| qo         |   644 | qo      | Open-ended Question                          | Question  |
| qh         |   565 | qh      | Rhetorical Question                          | Statement |
| ^h         |   553 | ^h      | Hold before answer/agreement                 | Other     |
| qy^g       |   436 | qy      | Tag question                                 | Statement |
| o@         |   339 | bc      | Overloaded TCU                               | Other     |
| ar         |   303 | ar      | Reject                                       | Statement |
| sv(^q)     |   301 | sv      | Statement-Opinion w/ Quotation               | Statement |
| ng         |   291 | ng      | Negative Non-No Answers                      | Statement |
| no         |   285 | no      | Other Answers                                | Statement |
| sd^r       |   248 | sd      | Statement, Self-repeat                       | Statement |
| br         |   237 | br      | Signal Non-Understanding                     | Other     |
| sd@        |   230 | sd      | Statement w/ error                           | Statement |
| qr         |   221 | qy      | Or Question                                  | Question  |
| fp         |   209 | fp      | Conventional Opening                         | Other     |
| qrr        |   199 | qrr     | Or-question tacked onto yes-no question      | Question  |
| ny^r       |   196 | ny      | Yes w/ repeat                                | Other     |
| nd         |   181 | nd      | Dispreferred Answer                          | Statement |
| sv^t       |   159 | sv      | Opinion about task                           | Statement |
| nn^r       |   137 | nn      | No Answer w/ repeat                          | Other     |
| fe         |   136 | ba      | Exclamation                                  | Statement |
| fc^m       |   131 | fc      | Conventional Closing w/ mimic                | Other     |
| %@         |   130 | %       | Abandoned w/ error                           | Other     |
| sv^e       |   118 | sv      | Opinion, expansion of y/n answer             | Statement |
| t3         |   117 | t3      | 3rd Party Talk                               | Other     |
| qy^t       |   115 | qy      | Yes/No Question about Task                   | Question  |
| t1         |   104 | t1      | Self-talk                                    | Other     |
| ba^r       |   103 | ba      | Appreciation w/ repeat                       | Other     |
| bd         |    96 | bd      | Downplayer                                   | Other     |
| ^g         |    92 | ^g      | Tag Question                                 | Statement |
| sv^r       |    88 | sv      | Opinion w/ repeat                            | Statement |
| sv@        |    84 | sv      | Opinion w/ error                             | Statement |
| qw^d       |    83 | qw^d    | Declarative wh-question                      | Question  |
| b@         |    80 | b       | Backchannel w/ error                         | Other     |
| ft         |    76 | ft      | Thanking                                     | Other     |
| fa         |    76 | fa      | Apology                                      | Statement |
| aa^m       |    70 | aa      | Accept w/ repeat                             | Other     |
| sd^m       |    67 | sd      | Statement w/ mimic                           | Statement |
| ad^t       |    64 | ad      | Action-directive about task                  | Command   |
| br^m       |    59 | br      | Signal Non-understanding w/ mimic            | Other     |
| aap        |    57 | am      | Accept Part                                  | Other     |
| sd^c       |    50 | sd      | Statement about communication                | Statement |
| qw^t       |    49 | qw      | Wh-question about task                       | Question  |
| co         |    49 | cc      | Offer                                        | Question  |
| x@         |    48 | x       | Non-speech w/ error                          | Other     |
| sd*        |    46 | sd      | Statement w/ transcription error             | Statement |
| am         |    44 | am      | Maybe                                        | Statement |
| ar^r       |    41 | ar      | Reject w/ repeat                             | Statement |
| na^r       |    37 | na      | Affirmative non-yes w/ repeat                | Statement |
| na^m       |    35 | na      | Affirmative non-yes w/ mimic                 | Statement |
| cc         |    35 | cc      | Commit                                       | Statement |
| "          |    35 | bc      | Other                                        | Other     |
| ba@        |    32 | ba      | Appreciation w/ error                        | Statement |
| bk^r       |    30 | bk      | Acknowledge w/ repeat                        | Other     |
| qy^r       |    29 | qy      | Yes-no Question w/ repeat                    | Question  |
| fc^t       |    29 | fc      | Conventional Closing about task              | Other     |
| sv^m       |    25 | sv      | Opinion w/ mimic                             | Statement |
| +          |    25 |         | Segment                                      | Other     |
| sv*        |    23 | sv      | Opinion w/ transcription Error               | Statement |
| arp        |    23 | nd      | Dispreferred Answer                          | Statement |
| sd(^q)^t   |    22 | sd      | Statement w/ quotation about task            | Statement |
| qy^h       |    21 | qy      | Yes-no Question hold before answer           | Question  |
| qy@        |    21 | qy      | Yes-no Question w/ error                     | Question  |
| bk^m       |    21 | bk      | Acknowledge Answer w/ mimic                  | Statement |
| aa@        |    21 | aa      | Accept w/ error                              | Statement |
| qy^g^t     |    19 | qy      | Yes-no Question Tag Question about Task      | Question  |
| by         |    19 | bc      | Sympathy                                     | Statement |
| fc^r       |    18 | fc      | Conventional Closing, repeat                 | Other     |
| sd,o@      |    16 | sd      | Statement, other                             | Statement |
| qy^m       |    16 | qy      | Yes-no question w/ mimic                     | Question  |
| qy^c       |    16 | qy      | Yes-no Question about communication          | Question  |
| fp^m       |    15 | fp      | Conventional Opening Mimic                   | Other     |
| qy^d^t     |    14 | qy^d    | Declarative Yes-no question about task       | Question  |
| qw^r       |    14 | qw      | Wh-question repeat                           | Question  |
| qr^d       |    13 | qy      | Declarative Or-question                      | Question  |
| co^t       |    13 | cc      | Offer about task                             | Question  |
| qw^h       |    11 | qw      | Wh-Question, hold before answer              | Question  |
| bc         |    11 | bc      | Correct Misspeaking                          | Other     |
| +*         |    11 |         | Continuation w/ transcription error          | Other     |
| sd^e^t     |    10 | sd      | Statement expanding y/n answer about task    | Statement |
| na^t       |    10 | na      | Affirmative Non-yes answer about task        | Statement |
| qw@        |     9 | qw      | Wh-question w/ error                         | Question  |
| fx         |     9 | sv      | Explicit Performative                        | Statement |
| sv,o@      |     8 | sv      | Opinion, other w/ error                      | Statement |
| sd^e@      |     8 | sd      | Statement expanding y/n answer w/ error      | Statement |
| qy^2       |     8 | qy      | Yes-no question w/ collaborative complete    | Question  |
| bf@        |     8 | bf      | Summarize/reformulate w/ error               | Statement |
| ny^m       |     7 | ny      | Yes Answer w/ Mimic                          | Statement |
| bd^r       |     7 | bd      | Downplaying w/ repeat                        | Other     |
| b*         |     7 | b       | Continuer w/ transcription error             | Other     |
| ^2@        |     7 | ^2      | Collaborative Completion w/ error            | Other     |
| qy^d^r     |     6 | qy^d    | Declarative Yes-no Question w/ repeat        | Question  |
| qy^d@      |     6 | qy^d    | Declarative Yes-no Question w/ error         | Question  |
| qrr^t      |     6 | qrr     | Or-question about task                       | Question  |
| qo^t       |     6 | qo      | Open Question about task                     | Question  |
| ny@        |     6 | ny      | Yes Answer w/ transcription error            | Statement |
| nn^m       |     6 | nn      | No answer w/ mimic                           | Statement |
| bh^m       |     6 | bh      | Rhetorical Question w/ mimic                 | Statement |
| bf^r       |     6 | bf      | Reformulate w/ repeat                        | Statement |
| ad(^q)     |     6 | ad      | Action direction w/ quotation                | Command   |
| ^q^t       |     6 | ^q      | Quotation about task                         | Statement |
| sv(^q)@    |     5 | sv      | Opinion w/ quotation and error               | Statement |
| sd^e^r     |     5 | sd      | Statement reply to y/n questions w/ repeat   | Statement |
| sd^e^m     |     5 | sd      | Statement reply to y/n questions w/ mimic    | Statement |
| sd^2       |     5 | sd      | Statement collaborative completion           | Statement |
| qrr^d      |     5 | qrr     | Declarative Or-question                      | Question  |
| o*         |     5 | bc      | Other w/ transcription error                 | Other     |
| nn^e       |     5 | ng      | No answer to y/n question                    | Other     |
| fo         |     5 | bc      | Other forward-function                       | Other     |
| ^2^g       |     5 | ^2      | Collaborative completion, tag question       | Question  |
| sd(^q)@    |     4 | sd      | Statement w/ quotation and error             | Statement |
| sd(^q)*    |     4 | sd      | Statement w/ quotation and trans. error      | Statement |
| qy^g@      |     4 | qy      | Yes-no tag question w/ error                 | Question  |
| qy^g*      |     4 | qy      | Yes-no tag question w/ transcription error   | Question  |
| qy^d^m     |     4 | qy^d    | Declarative Yes-no question w/ mimic         | Question  |
| qy(^q)     |     4 | qy      | Yes-no Question w/ quotation                 | Question  |
| qo^d       |     4 | qo      | Declarative Open Question                    | Question  |
| qh^m       |     4 | qh      | Rhetorical Question w/ mimic                 | Statement |
| oo         |     4 | cc      | Offer                                        | Question  |
| o^r        |     4 | bc      | Other w/ repeat                              | Other     |
| no^t       |     4 | no      | Other answers about task                     | Statement |
| ng^r       |     4 | ng      | Negative Non-no answer w/ repeat             | Statement |
| h^r        |     4 | h       | Hedge w/ repeat                              | Other     |
| ad^r       |     4 | ad      | Action directive w/ repeat                   | Command   |
| ad^c       |     4 | ad      | Action directive about communication         | Command   |
| ad@        |     4 | ad      | Action directive w/ error                    | Command   |
| aa*        |     4 | aa      | Accept w/ transcription error                | Statement |
| sv^c       |     3 | sv      | Opinion about communication                  | Statement |
| sv^2       |     3 | sv      | Opinion w/ collaborative completion          | Statement |
| sv,sd,o@   |     3 | sv      | Opinion, Statement, Other w/ error           | Statement |
| qy*        |     3 | qy      | Yes-no Question w/ transcription error       | Question  |
| qw^g       |     3 | qw      | Wh-Question tag question                     | Question  |
| qw^d^t     |     3 | qw^d    | Declarative Qh-Question about task           | Question  |
| qr^t       |     3 | qy      | Or-question about task                       | Question  |
| qh@        |     3 | qh      | Rhetorical Question w/ error                 | Statement |
| o^c        |     3 | bc      | Other about communication                    | Other     |
| nd^t       |     3 | nd      | Dispreferred answer about task               | Statement |
| na@        |     3 | na      | Affirmative Yes-no Answer w/ error           | Statement |
| fw         |     3 | bc      | You're Welcome                               | Statement |
| fp^r       |     3 | fp      | Conventional Opening w/ repeat               | Other     |
| co^c       |     3 | cc      | Offer about communication                    | Question  |
| bh^r       |     3 | bh      | Backchannel in Question Form w/ repeat       | Statement |
| bh@        |     3 | bh      | Backchannel in Question Form w/ error        | Statement |
| bf^m       |     3 | bf      | Summarize w/ mimic                           | Statement |
| ba^m       |     3 | ba      | Appreciation w/ mimic                        | Statement |
| b^m^t      |     3 | b^m     | Repeat phrase about task                     | Other     |
| aa^t       |     3 | aa      | Accept about task                            | Statement |
| aa^2       |     3 | aa      | Accept w/ collaborative completion           | Statement |
| ^q@        |     3 | ^q      | Quotation w/ error                           | Statement |
| ^q*        |     3 | ^q      | Quotation w/ transcription error             | Statement |
| %*         |     3 | %       | Abandoned w/ transcription error             | Other     |
| x*         |     2 | x       | Non-verbal w/ transcription error            | Other     |
| sd^q       |     2 | sd      | Statement w/ quotation                       | Statement |
| qy^g^r     |     2 | qy      | Yes-no Tag Question w/ repeat                | Question  |
| qy^g^c     |     2 | qy      | Yes-no Tag Question about communication      | Question  |
| qy^d^h     |     2 | qy^d    | Declarative Yes-No Question hold             | Question  |
| qy^c^r     |     2 | qy      | Yes-no about communication w/ repeat         | Question  |
| qw^m       |     2 | qw      | Wh-question w/ mimic                         | Question  |
| qw^c       |     2 | qw      | Wh-question about communication              | Question  |
| qw*        |     2 | qw      | Wh-question w/ transcription error           | Question  |
| qh^r       |     2 | qh      | Rhetorical Question w/ repeat                | Statement |
| qh^h       |     2 | qh      | Rhetorical Question w/ hold                  | Statement |
| oo^t       |     2 | cc      | Open Offer about task                        | Question  |
| o^t        |     2 | bc      | Other about task                             | Other     |
| ny^e       |     2 | na      | Yes Answer Plus Expansion                    | Statement |
| ny^c       |     2 | ny      | Yes Answer about communication               | Statement |
| no^r       |     2 | no      | Other Answer w/ repeat                       | Other     |
| nn*        |     2 | nn      | No Answer w/ transcription error             | Statement |
| ng^m       |     2 | ng      | Negative Non-no Answer w/ mimic              | Statement |
| h^t        |     2 | h       | Hedge about task                             | Other     |
| fc@        |     2 | fc      | Conventional closing w/ error                | Other     |
| fa^c       |     2 | fa      | Apology about communication                  | Statement |
| cc^r       |     2 | cc      | Commit w/ repeat                             | Statement |
| br^r       |     2 | br      | Signal Non-Understanding w/ repeat           | Other     |
| bk@        |     2 | bk      | Acknowledge w/ error                         | Other     |
| bf^t       |     2 | bf      | Reformulation about task                     | Statement |
| bf^g       |     2 | bf      | Reformulation Tag Question                   | Statement |
| bf*        |     2 | bf      | Reformulation w/ transcription error         | Statement |
| bf(^q)     |     2 | bf      | Reformulation w/ quotation                   | Statement |
| bc^r       |     2 | bc      | Correct Misspeaking w/ repeat                | Other     |
| b^m^r      |     2 | b^m     | Continuer w/ mimic and repeat                | Other     |
| b^m^g      |     2 | b^m     | Tag Question Continuer w/ mimic              | Statement |
| b^m@       |     2 | b^m     | Continuer w/ mimic and error                 | Statement |
| am^r       |     2 | am      | Maybe w/ repeat                              | Statement |
| ad*        |     2 | ad      | Action directive w/ error                    | Command   |
| aa,o@      |     2 | aa      | Accept, Other w/ error                       | Statement |
| ^q^r       |     2 | ^q      | Quotation Repeat                             | Statement |
| ^h^r       |     2 | ^h      | Hold w/ repeat                               | Statement |
| ^2*        |     2 | ^2      | Collaborative Completion w/ transcript error | Other     |
| t1^t       |     1 | t1      | Self-talk about task                         | Other     |
| sv^e^r     |     1 | sv      | Opinion Answer w/ repeat                     | Statement |
| sv;sd      |     1 | sv      | Opinion, statement                           | Statement |
| sv,qy^g@   |     1 | sv      | Opinion, Yes-no Tag Question                 | Statement |
| sv(^q)*    |     1 | sv      | Opinion w/ Quotation and Error               | Statement |
| sd^t*      |     1 | sd      | Statement about task w/ transcription error  | Statement |
| sd^r@      |     1 | sd      | Statement w/ repeat and error                | Statement |
| sd^m@      |     1 | sd      | Statement w/ mimic and error                 | Statement |
| sd^m*      |     1 | sd      | Statement w/ mimic and transcription error   | Statement |
| sd^e(^q)^r |     1 | sd      | Statement exp of y/n quest. w/ quote/repeat  | Statement |
| sd;sv      |     1 | sv      | Statement, opinion                           | Statement |
| sd;qy^d    |     1 | sd      | Statement, Declarative Yes-no Question       | Statement |
| sd;no      |     1 | sd      | Statement, Other Answer                      | Statement |
| sd,sv      |     1 | sv      | Statement, Opinion                           | Statement |
| sd,qy^g    |     1 | sd      | Statement, Yes-no Tag Question               | Statement |
| sd(^q)^r   |     1 | sd      | Statement w/ Quotation and repeat            | Statement |
| qy^h@      |     1 | qy      | Yes-no Question, hold w/ error               | Question  |
| qy^d^c     |     1 | qy^d    | Declarative Yes-no Question about comm       | Question  |
| qy^d*      |     1 | qy^d    | Declarative Yes-no Question w/ transc. error | Question  |
| qy^d(^q)   |     1 | qy^d    | Declarative Yes-no Question w/ quotation     | Question  |
| qy,am,o@   |     1 | qy      | Yes-no Question, Maybe, Other w/ error       | Question  |
| qw^t@      |     1 | qw      | Wh-question about task w/ error              | Question  |
| qw^r^t     |     1 | qw      | Wh-Question w/ repeat about task             | Question  |
| qw^d^m     |     1 | qw^d    | Declarative Wh-Question w/ mimic             | Question  |
| qw^d^c     |     1 | qw^d    | Declarative Wh-Question about communication  | Question  |
| qw^d@      |     1 | qw^d    | Declarative Wh-Question w/ error             | Question  |
| qw(^q)     |     1 | qw      | Wh-Question w/ quotation                     | Question  |
| qrr@       |     1 | qrr     | Or-question w/ error                         | Question  |
| qr^d*      |     1 | qy      | Declarative Or question w/ trans. error      | Question  |
| qr(^q)     |     1 | qy      | Or-question w/ quotation                     | Question  |
| qo^r       |     1 | qo      | Open-ended question w/ repeat                | Question  |
| qo^d^c     |     1 | qo      | Decl Open-ended question about comm          | Question  |
| qo@        |     1 | qo      | Open Ended Question w/ error                 | Question  |
| qh^g       |     1 | qh      | Rhetorical Tag Question                      | Statement |
| qh^c       |     1 | qh      | Rhetorical Question about communication      | Statement |
| qh*        |     1 | qh      | Rhetorical Question with transcription error | Statement |
| qh(^q)     |     1 | qh      | Rhetorical Question with quotation           | Statement |
| oo(^q)     |     1 | cc      | Offer with Quotation                         | Question  |
| ny^t       |     1 | ny      | Yes Answer about task                        | Statement |
| ny^c^r     |     1 | ny      | Yes Answer about communication w/ repeat     | Statement |
| ny*        |     1 | ny      | Yes Answer w/ transcription error            | Statement |
| no@        |     1 | no      | Other answer w/ error                        | Statement |
| nn^t       |     1 | nn      | No Answers about task                        | Statement |
| nn^r^t     |     1 | nn      | No Answers w/ repeat about task              | Statement |
| nn^r@      |     1 | nn      | No Answers w/ repeat and error               | Statement |
| ng^t       |     1 | ng      | Negative Non-no Answers about task           | Statement |
| ng^r,o@    |     1 | ng      | Neg Non-No Answers w/ repeat, other w/ error | Statement |
| na^m^t     |     1 | na      | Aff Non-Yes Answers w/ mimic about task      | Statement |
| na,sd,o@   |     1 | na      | Affirmative Non-Yes Answer, Statement, Other | Statement |
| h^m        |     1 | h       | Hold w/ mimic                                | Statement |
| h@         |     1 | h       | Hold w/ error                                | Statement |
| h,sd       |     1 | h       | Hold, statement                              | Statement |
| fw*        |     1 | bc      | You're Welcome w/ error                      | Statement |
| ft^t       |     1 | ft      | Thanking about task                          | Other     |
| ft^m       |     1 | ft      | Thanking w/ mimic                            | Other     |
| fo^c       |     1 | bc      | Other forward function about communication   | Other     |
| fc,o@      |     1 | fc      | Conventional Closing, Other w/ error         | Other     |
| fa^t       |     1 | fa      | Apology about task                           | Statement |
| fa^r       |     1 | fa      | Apology w/ repeat                            | Statement |
| cc^t       |     1 | cc      | Commit about task                            | Statement |
| br,o@      |     1 | br      | Signal Non-Understanding, Other w/ error     | Other     |
| bk^t       |     1 | bk      | Response Acknowledgement about task          | Statement |
| bk,sd,o@   |     1 | bk      | Acknowledgement, Statement, Other w/ error   | Statement |
| bh,sd,o@   |     1 | bh      | Backchannel, Statement, Other w/ error       | Statement |
| bf^2       |     1 | bf      | Reformulation w/ collaborative completion    | Statement |
| bf,nn,o@   |     1 | bf      | Reformulation, No Answer, Other w/ error     | Statement |
| bd@        |     1 | bd      | Downplayer w/ error                          | Statement |
| ba^m@      |     1 | ba      | Appreciation w/ mimic and error              | Statement |
| ba,fe      |     1 | ba      | Appreciation, Exclamation                    | Statement |
| b^t        |     1 | b       | Continuer about task                         | Other     |
| b^r@       |     1 | b       | Continuer w/ repeat and error                | Other     |
| b^m,sd,o@  |     1 | b^m     | Cont. w/ mimic, statement, other w/ error    | Statement |
| b^2        |     1 | b       | Continuer w/ collaborative completion        | Other     |
| ar^m       |     1 | ar      | Reject w/ mimic                              | Statement |
| ad,qy@     |     1 | ad      | Action directive, Yes-no Question w/ error   | Command   |
| ad,o@      |     1 | ad      | Action directive, Other w/ error             | Command   |
| aap^r      |     1 | am      | Accept Part w/ repeat                        | Statement |
| aap^m      |     1 | am      | Accept Part w/ mimic                         | Statement |
| aa^r,o@    |     1 | aa      | Accept w/ repeat, other w/ error             | Statement |
| aa^h       |     1 | aa      | Accept & hold                                | Statement |
| aa,ar      |     1 | aa      | Accept, Reject                               | Statement |
| ^h^t       |     1 | ^h      | Hold about task                              | Statement |
| ^h@        |     1 | ^h      | Hold w/ error                                | Statement |
| ^g@        |     1 | ^g      | Tag Question w/ error                        | Question  |
| ^2^t       |     1 | ^2      | Collaborative completion about task          | Other     |
| ^2^r       |     1 | ^2      | Collaborative completion w/ repeat           | Other     |
| %@*        |     1 | %       | Abandoned w/ errors                          | Other     |
| %,o@       |     1 | %       | Abandoned, other w/ error                    | Other     |
